In [1]:
import pandas as pd
from pathlib import Path
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression

In [2]:
df = pd.read_csv(Path('SJ_County_4.csv'))
df.head()

      Month  San_Joaquin_Pop  San_Joaquin_Wages  San_Joaquin_Avg_HV
0  1/1/2000           567885               2260              166188
1  2/1/2000           569829               2269              165106
2  3/1/2000           571772               2279              165181
3  4/1/2000           573716               2288              165407
4  5/1/2000           575659               2297              166873

In [3]:
df['Outcome'] = ""

In [4]:
df

         Month  San_Joaquin_Pop  San_Joaquin_Wages  San_Joaquin_Avg_HV Outcome
0     1/1/2000           567885               2260              166188
1     2/1/2000           569829               2269              165106
2     3/1/2000           571772               2279              165181
3     4/1/2000           573716               2288              165407
4     5/1/2000           575659               2297              166873
..         ...              ...                ...                 ...     ...
115   8/1/2009           683214               3050              178910
116   9/1/2009           683997               3055              175089
117  10/1/2009           684779               3059              175404
118  11/1/2009           685562               3063              175852
119  12/1/2009           686344               3068              180736

[120 rows x 5 columns]

In [5]:
df['San_Joaquin_Avg_HV'].mean()

290475.1

In [6]:
df['San_Joaquin_Avg_HV'].median()

264352.5

In [7]:
df['Outcome'] = df['San_Joaquin_Avg_HV'].apply(lambda x: 0 if x <= 280000 else 1)

In [8]:
df

,Month,San_Joaquin_Pop,San_Joaquin_Wages,San_Joaquin_Avg_HV,Outcome
0,1/1/2000,567885,2260,166188,0
1,2/1/2000,569829,2269,165106,0
2,3/1/2000,571772,2279,165181,0
3,4/1/2000,573716,2288,165407,0
4,5/1/2000,575659,2297,166873,0
...,...,...,...,...,...
115,8/1/2009,683214,3050,178910,0
116,9/1/2009,683997,3055,175089,0
117,10/1/2009,684779,3059,175404,0
118,11/1/2009,685562,3063,175852,0
119,12/1/2009,686344,3068,180736,0

In [9]:
y = df["Outcome"]
X = df.drop(columns=["Month","San_Joaquin_Avg_HV","Outcome"])

In [10]:
y

0      0
1      0
2      0
3      0
4      0
      ..
115    0
116    0
117    0
118    0
119    0
Name: Outcome, Length: 120, dtype: int64

In [11]:
X

     San_Joaquin_Pop  San_Joaquin_Wages
0             567885               2260
1             569829               2269
2             571772               2279
3             573716               2288
4             575659               2297
..               ...                ...
115           683214               3050
116           683997               3055
117           684779               3059
118           685562               3063
119           686344               3068

[120 rows x 2 columns]

In [12]:
y.shape

(120,)

In [13]:
X.shape

(120, 2)

In [14]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, 
                                                    y, 
                                                    random_state=1, 
                                                    stratify=y)
X_train.shape

(90, 2)

In [15]:
from sklearn.linear_model import LogisticRegression
classifier = LogisticRegression(solver='lbfgs',
                                max_iter=200,
                                random_state=1)

In [16]:
classifier.fit(X_train, y_train)

LogisticRegression(max_iter=200, random_state=1)

In [17]:
y_pred = classifier.predict(X_test)
results = pd.DataFrame({"Prediction": y_pred, "Actual": y_test}).reset_index(drop=True)
results.head(20)

    Prediction  Actual
0            0       0
1            0       0
2            0       0
3            0       1
4            0       0
5            1       0
6            1       0
7            0       1
8            0       1
9            0       0
10           0       0
11           0       1
12           0       0
13           1       1
14           0       1
15           0       0
16           0       1
17           0       0
18           0       0
19           0       1

In [18]:
from sklearn.metrics import accuracy_score
print(accuracy_score(y_test, y_pred))

0.6

In [19]:
from sklearn.metrics import confusion_matrix, classification_report
matrix = confusion_matrix(y_test, y_pred)
print(matrix)

[[14  3]
 [ 9  4]]

In [20]:
report = classification_report(y_test, y_pred)
print(report)

              precision    recall  f1-score   support

           0       0.61      0.82      0.70        17
           1       0.57      0.31      0.40        13

    accuracy                           0.60        30
   macro avg       0.59      0.57      0.55        30
weighted avg       0.59      0.60      0.57        30